Ran Plan for dir: `terraform/static` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # module.vault.helm_release.helm will be created
+ resource "helm_release" "helm" {
      + atomic                     = false
      + chart                      = "vault"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "vault"
      + namespace                  = "vault"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://helm.releases.hashicorp.com"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + <<-EOT
                ---
                {yaml}
            EOT,
        ]
      + verify                     = false
      + version                    = "0.24.1"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # module.vault.kubernetes_namespace.ns will be created
+ resource "kubernetes_namespace" "ns" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "vault"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.


Invalid attribute in provider configuration

  with provider["registry.terraform.io/hashicorp/kubernetes"],
  on provider.tf line 14, in provider "kubernetes":
  14: provider "kubernetes" {

'config_path' refers to an invalid path: "/home/atlantis/.kube/config": stat
/home/atlantis/.kube/config: no such file or directory
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d terraform/static`
* :put_litter_in_its_place: To **delete** this plan click [here](http://atlantis.shutthegoatup.com/lock?id=shutthegoatup%252Fhomelab%252Fterraform%252Fstatic%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d terraform/static`
</details>
Plan: 2 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`